app/views/employees/show.html.slim

br
- @employee.projects.each do |project|
---
SELECT "projects".* FROM "projects" WHERE "projects"."employee_id" = $1  [["employee_id", 1]]