app/views/divisions/show.html.slim

br
- @division.employees.each do |employee|
---
SELECT "employees".* FROM "employees" WHERE "employees"."division_id" = $1  [["division_id", 2]]