app/views/projects/show.html.slim

br
- @project.employees.each do |employee|
---
SELECT "employees".* FROM "employees" WHERE "employees"."project_id" = $1  [["project_id", 1]]