app/controllers/divisions_controller.rb

SELECT "divisions".* FROM "divisions" ORDER BY "divisions"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
      @divisions = Division.all

INSERT INTO "divisions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "First Division"], ["created_at", "2021-11-03 08:01:55.699852"], ["updated_at", "2021-11-03 08:01:55.699852"]]
---
    def create
        @division =  Division.create(division_params)

SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def show
        @division = Division.find(params[:id])
        @users = User.all
        @user = User.first

SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def update
        @division = Division.find(params[:id])