app/controllers/employees_controller.rb

SELECT "divisions".* FROM "divisions"
---
    def new
        @employee = Employee.new
        @divisions = Division.all
        @array = Division.all.map { |div| [div.name, div.id] }

INSERT INTO "employees" ("name", "division_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "The Employee"], ["division_id", 1], ["created_at", "2021-11-03 10:54:25.833315"], ["updated_at", "2021-11-03 10:54:25.833315"]]
---
    def create
        @employee =  Employee.create(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects"
---
    def show
        @employee = Employee.find(params[:id])
        @array = Project.all.map { |p| [p.name, p.id] }

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "name" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["name", "The Employee 1"], ["updated_at", "2021-11-03 11:07:51.914780"], ["id", 1]]
---
    def update
        @employee = Employee.find(params[:id])

        if @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "project_id" = $1 WHERE "employees"."project_id" = $2 AND "employees"."id" = $3  [["project_id", nil], ["project_id", 1], ["id", 1]]
UPDATE "projects" SET "updated_at" = $1, "employee_id" = $2 WHERE "projects"."id" = $3  [["updated_at", "2021-11-03 11:07:56.305577"], ["employee_id", 1], ["id", 1]]
---
    def add
        @employee = Employee.find(params[:id])
        @employee.projects.append(Project.find(params[:project_id]))
        @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def remove
        @employee = Employee.find(params[:id])
        @project = Project.find(params[:p_id])