app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @projects = Project.all
        authorize @projects || @projects.first

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "this is a projects"], ["created_at", "2021-11-03 10:47:39.354810"], ["updated_at", "2021-11-03 10:47:39.354810"]]
---
    def create
        @project = Project.create(project_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "employees".* FROM "employees"
---
    def show
        @project = Project.find(params[:id])
        @array = Employee.all.map { |div| [div.name, div.id] }

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "employee_id" = $1 WHERE "projects"."employee_id" = $2 AND "projects"."id" = $3  [["employee_id", nil], ["employee_id", 1], ["id", 1]]
UPDATE "employees" SET "updated_at" = $1, "project_id" = $2 WHERE "employees"."id" = $3  [["updated_at", "2021-11-03 11:15:44.382092"], ["project_id", 1], ["id", 1]]
---
    def add
        @project = Project.find(params[:project_id])
        authorize @project
        @project.employees.append(Employee.find(params[:employee_id]))
        @project.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def remove
        @employee = Employee.find(params[:id])
        @project = Project.find(params[:p_id])